local instructionTextTable = {
    ["instructionDefault"] = {"[F1]紧急后悔            [F2]一键吞饰品           [F3]强制蒙眼",
                              "[F4]键盘映射            [F5]测试模式              [F6]功能选项菜单",
                              "[F7]ban道具              [F8]原地换人              [RCtrl]下一页",
                              "按[Tab]切换中文输入；[LAlt]+[F1]或[F2]可以在控制台界面关闭时生效",
                              "[s]楼层传送          [g]获得物品           [r]移除物品            [u]使用物品",
                              "[sp]生成实体        [d]开关Debug         [ls]查看种子记录     [ds]删除部分种子记录",
                              "[rep]重复指令       [cl]清空控制台       [LCtrl]上一页          [RCtrl]下一页",
                              "使用全称[stage giveitem remove useitem spawn debug repeat listseed deleteseed clear]也可触发",
                              "[res]重新开始             [cha]开始挑战            [gs]生成障碍物",
                              "[cos]换装测试             [cur]添加诅咒            [go]传送房间",
                              "[rew]倒回上个房间      [cut]播放过场动画     [LCtrl]上一页",
                              "[restart challenge gridspawn costumetest curse goto rewind cutscene]也可触发"},

    ["instructionDeath"] = {"[rew]或[rewind]", "倒回上个房间", "其余指令无效", "(除lua指令)"},

    ["instructionChangePlayerType"] = {"[0]以撒  [1]抹大拉  [2]该隐  [3]犹大  [4]小蓝人  [5]夏娃  [6]参孙",
                                       "[7]阿撒泻勒  [8]拉萨路  [9]伊甸  [10]游魂  [11]复活的拉萨路",
                                       "[12]犹大之影  [13]莉莉丝  [14]店主  [15]亚玻伦  [RCtrl]下一页",
                                       "[16]遗骸  [17]遗骸之魂  [18]伯大尼  [19]雅各和以扫  [20]以扫",
                                       "[21]里以撒  [22]里抹大拉  [23]里该隐  [24]里犹大  [25]里蓝人",
                                       "[26]里夏娃  [27]里参孙  [28]里AZ  [LCtrl]上一页  [RCtrl]下一页",
                                       "[29]里拉萨路  [30]里伊甸  [31]里罗  [32]里莉莉丝  [33]里店长",
                                       "[34]里亚玻伦  [35]里骨  [36]里伯大尼  [37]里双  [38]里拉萨路2",
                                       "[39]里双游魂形态  [40]里骨之魂  [LCtrl]上一页"},

    ["instructionBan"] = {"[ID]从道具池中移除ID对应的单个道具",
                          "[q][X]从道具池中移除所有X级道具，X为道具品质",
                          "例如：[ban 114]把道具妈刀ban掉  [ban q0]把所有0级道具ban掉"},

    ["instructionStage"] = {{"[1]地下室      [2]地下室      [3]洞穴      [4]洞穴",
                             "[5]深牢      [6]深牢      [7]子宫      [8]子宫",
                             "[9]蓝子宫      [10]阴间      [11]暗室      [12]虚空      [13]家"},
                            {"[1]地下室      [2]洞穴      [3]深牢", "[4]子宫        [5]阴间       [6]商店",
                             "[7]究极贪婪"}},

    ["instructionGiveitem"] = {"[c][ID]获得道具      [t/T][ID]获得(金)饰品",
                               "[p/P][ID]获得(大)胶囊      [k][ID]获得卡牌或符文或魂石",
                               "[name]获得道具或饰品"},

    ["instructionRemove"] = {"[c][ID]移除道具      [t][ID]移除饰品",
                             "[name]移除道具或饰品",
                             "[*]移除所有道具和饰品除错误道具（若有多个相同道具只移除一个）"},

    ["instructionUseitem"] = {"[c][Id]使用主动道具/获得当前房间被动道具（部分）",
                              "[p/P][ID]使用(大)胶囊      [k][ID]使用卡牌或符文或魂石",
                              "[b][ID]使用里蓝人大便"},

    ["instructionSpawn"] = {"[2]眼泪        [3]跟班        [4]炸弹        [5]掉落物",
                            "[6]可互动实体        [7]激光        [8]刀        [9]发射物",
                            "[10-921]怪物        [950-967]忏悔杂项        [1000]特效"},

    ["instructionDebug"] = {"[1]显示实体位置     [2]显示单元格障碍物ID     [3]无限血量",
                            "[4]高伤害     [5]显示房间信息     [6]显示碰撞箱",
                            "[7]显示伤害     [8]无限充能     [9]高幸运     [RCtrl]下一页",
                            "[10]快速消灭     [11]显示单元格信息",
                            "[12]显示角色道具信息     [13]显示单元格碰撞点",
                            "[14]显示Lua内存使用情况     [LCtrl]上一页"},

    ["instructionRepeat"] = {"[X]执行上一条成功生效的指令X次",
                             "（包含普通控制台指令和Lua指令）",
                             "（不包含clear, repeat, rewind, ban指令）"},

    ["instructionClear"] = {"cl清空控制台     clear清空控制台"},

    ["instructionChallenge"] = {"[0]无挑战  [1]漆黑一片  [2]格调高雅  [3]头部创伤  [4]黑暗降临",
                                "[5]坦克  [6]太阳系  [7]自杀之王  [8]好奇害死猫  [9]拆迁办",
                                "[10]诅咒！  [11]玻璃大炮  [12]当生活充满酸意  [RCtrl]下一页",
                                "[13]豆子！  [14]尽在卡牌中  [15]慢吞吞  [16]技术宅  [17]吐豆人",
                                "[18]宿主  [19]顾家男人  [20]返璞归真  [21]超超超超超大层",
                                "[22]快马加鞭！  [23]蓝色炸弹人  [LCtrl]上一页  [RCtrl]下一页",
                                "[24]充钱游戏  [25]没心没肺  [26]以撒传说！ [27]脑子！",
                                "[28]彩虹日！  [29]俄南连击  [30]守护者  [31]本末倒置",
                                "[32]愚人节  [33]宝可萌  [LCtrl]上一页  [RCtrl]下一页",
                                "[34]终极困难  [35]乒乓  [36]掏粪男孩  [37]血腥玛丽",
                                "[38]圣火洗礼  [39]以撒织梦岛  [40]重影幻视  [41]异食游戏",
                                "[42]烫手山芋  [43]大量过牌！  [44]赤键救赎  [45]  [LCtrl]上一页"},

    ["instructionGridspawn"] = {"[4]点燃的炸弹   [5]随机掉落物   [999]杂项   [1000-1011]石头",
                                "[1300]炸药桶   [1490-1501]大便   [1900-1901]方块",
                                "[1930-1931]地刺   [1940]蛛网   [RCtrl]下一页",
                                "[3000]沟壑   [4000]钥匙方块   [4500]按钮   [5000]恶魔雕像",
                                "[5001]天使雕像   [6000-6001]铁轨   [6100]传送点",
                                "[9000]活板门   [9100]暗门   [10000]重力   [LCtrl]上一页"},

    ["instructionCostumetest"] = {"[X]获得X个随机道具的角色形象", "（不改变角色的人物大小）",
                                  "（不会获得道具）"},

    ["instructionCurse"] = {"[X]获得诅咒，X为八个诅咒分别所代表的数字之和",
                            "黑暗诅咒1  迷宫诅咒2  迷途诅咒4  未知诅咒8  诅咒诅咒16",
                            "混乱诅咒32  致盲诅咒64  大房间诅咒128     [RCtrl]下一页",
                            "例如：[curse 41] 混乱诅咒+未知诅咒+黑暗诅咒 (41=32+8+1)",
                            "[cur 130] 大房间诅咒+迷宫诅咒 (130=128+2)",
                            "[curse 0] 清除通过curse指令添加的诅咒     [LCtrl]上一页"},

    ["instructionGoto"] = {"d.[ID]传送至普通房间    s.[type].[ID]传送至特殊房间",
                           "goto x.[type].[ID]在特定楼层传送至特殊布局房间",
                           "例如：[goto x.itemdungeon.666]在<家>层传送至祸兽房间"},

    ["instructionRewind"] = {"rew倒回上个房间     rewind倒回上个房间"},

    ["instructionCutscene"] = {"[1]开场动画  [2]制作人员名单  [3]妈腿结局  [4]妈心1  [5]妈心2",
                               "[6]妈心3  [7]妈心4  [8]妈心5  [9]妈心6  [10]妈心7  [11]妈心8",
                               "[12]妈心9  [13]妈心10  [14]妈心11  [15]地狱结局  [RCtrl]下一页",
                               "[16]天堂结局  [17]宝箱层结局  [18]黑暗层结局  [19]大撒旦结局",
                               "[20]凹凸结局  [21]贪婪模式结局  [22]百变怪结局  [23]困贪结局",
                               "[24]见证者结局  [25]教条死后动画  [26]祸兽结局  [LCtrl]上一页"},

    ["instructionListseed"] = {"查看全部种子记录"},

    ["instructionDeleteseed"] = {"[X]保留最近X局, 删除之前的所有种子记录",
                                 "（X为1到20之间的整数）"},

    ["instructionDisplayWinStreak"] = {"查看当前连胜数"}
}

return instructionTextTable
